tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "thoughtbot/formulae"
tap "unused-code/formulae"
tap "goles/battery"

brew "aria2"
brew "asdf"
brew "bandwhich"
brew "bat"
brew "bottom"
brew "chrome-cli"
brew "curl"
brew "detox"
brew "diff-so-fancy"
brew "diffutils"
brew "dog"
brew "dust"
brew "eth-p/software/bat-extras"
brew "fd"
brew "ffmpeg"
brew "font-iosevka-nerd-font"
brew "fzf"
brew "git"
brew "git-extras"
brew "gnu-sed"
brew "gnuplot"
brew "go"
brew "goles/battery/battery"
brew "grep"
brew "grex"
brew "heroku"
brew "hexyl"
brew "httpie"
brew "hub"
brew "iftop"
brew "jq"
brew "less"
brew "moreutils"
brew "mpv", args: ["HEAD"]
brew "neovim"
brew "oniguruma"
brew "openssl"
brew "pdfgrep"
brew "pgcli"
brew "pgrep"
brew "pngcrush"
brew "pngpaste"
brew "pngquant"
brew "postgresql", restart_service: true
brew "procs"
brew "proselint"
brew "pspg"
brew "pstree"
brew "ranger", args: ["HEAD"]
brew "rcm"
brew "redis", restart_service: true
brew "ripgrep"
brew "rmlint"
brew "rust"
brew "sd"
brew "shellcheck"
brew "sinclairtarget/wst/um"
brew "socat"
brew "speedtest-cli"
brew "subliminal"
brew "tag"
brew "tealdeer"
brew "terminal-notifier"
brew "thoughtbot/formulae/parity"
brew "tldr"
brew "tokei"
brew "translate-shell"
brew "tree"
brew "unar"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "unused"
brew "watch"
brew "wifi-password"
brew "xh"
brew "xmlstarlet"
brew "xsv"
brew "youtube-dl"
brew "zinit"

# cask "netnewswire" TODO
cask "alacritty"
cask "alfred"
cask "android-file-transfer"
cask "anki"
cask "appcleaner"
cask "calibre"
cask "choosy"
cask "coconutbattery"
cask "dash"
cask "dropbox"
cask "font-inconsolata"
cask "font-iosevka"
cask "gitify"
cask "karabiner-elements"
cask "keyboard-cleaner"
cask "marked"
cask "mattr-slate"
cask "ngrok"
cask "omnifocus"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklook-pat"
cask "quicklookase"
cask "skype"
cask "suspicious-package"
cask "webpquicklook"
cask "whatsapp"
cask "xee"
