# ansiweather: Weather in your terminal, with ANSI colors and Unicode symbols
# aria2: Download with resuming and segmented downloading
# ascii: List ASCII idiomatic names and octal/decimal code-point forms
# asciinema: Record and share terminal sessions
# asdf: Extendable version manager with support for Ruby, Node.js, Erlang & more
# bandwhich: Terminal bandwidth utilization tool
# bash: Bourne-Again SHell, a UNIX command interpreter
# bats-core: Bash Automated Testing System
# bmon: Interface bandwidth monitor
# briss: Crop PDF files # choose-rust: Human-friendly and fast alternative to cut and (sometimes) awk
# chrome-cli: Control Google Chrome from the command-line
# bottom: A cross-platform graphical process/system monitor with a customizable interface and a multitude of features.
# colordiff: Color-highlighted diff(1) output
# csvkit: Suite of command-line tools for converting to and working with CSV
# curl: Get a file from an HTTP, HTTPS or FTP server
# detox: Utility to replace problematic characters in filenames
# diffutils: File comparison utilities
# docker: Pack, ship and run any application as a lightweight container
# docker-completion: Bash, Zsh and Fish completion for Docker
# docker-compose: Isolated development environments using Docker
# docker-machine: Create Docker hosts locally and on cloud providers
# dog: Command-line DNS client
# dos2unix: Convert text between DOS, UNIX, and Mac formats
# dust: More intuitive version of du in rust
# duti: Select default apps for documents and URL schemes on macOS
# elixir: Functional metaprogramming aware language built on Erlang VM
# emscripten: LLVM bytecode to JavaScript compiler
# bat-extras: Bash scripts that integrate bat with various command-line tools
# exa: Modern replacement for 'ls'
# exercism: Command-line tool to interact with exercism.io
# exiftool: Perl lib for reading and writing EXIF metadata
# fd: Simple, fast and user-friendly alternative to find
# candle: Shine a little light on your HTML using the command line
# gdrive: Google Drive CLI Client
# geckodriver: WebDriver <-> Marionette proxy
# gh: GitHub command-line tool
# git: Distributed revision control system
# git-extras: Small git utilities
# git-filter-repo: Quickly rewrite git repository history
# git-standup: Git extension to generate reports for standup meetings
# gnu-sed: GNU implementation of the famous stream editor
# gnuplot: Command-driven, interactive function plotting
# go: Open source programming language to build simple/reliable/efficient software
# battery: [no description]
# gradle: Open-source build automation tool based on the Groovy and Kotlin DSL
# graphviz: Graph visualization software from AT&T and Bell Labs
# grep: GNU grep, egrep and fgrep
# grex: Command-line tool for generating regular expressions
# gtk+3: Toolkit for creating graphical user interfaces
# hexyl: Command-line hex viewer
# highlight: Convert source code to formatted text with syntax highlighting
# httpie: User-friendly cURL replacement (command-line HTTP client)
# httrack: Website copier/offline browser
# hub: Add GitHub support to git on the command-line
# iftop: Display an interface's bandwidth usage
# imagemagick: Tools and libraries to manipulate images in many formats
# languagetool: Style and grammar checker
# less: Pager program similar to more
# lesspipe: Input filter for the pager less
# libproxy: Library that provides automatic proxy configuration management
# llvm: Next-gen compiler infrastructure
# locateme: Find your location using Apple's geolocation services
# valgrind: Dynamic analysis tools (memory, debug, profiling)
# lsd: Clone of ls with colorful output, file type icons, and more
# maven: Java-based project management
# mitmproxy: Intercept, modify, replay, save HTTP/S traffic
# mono: Cross platform, open source .NET development framework
# moreutils: Collection of tools that nobody wrote when UNIX was young
# mpv: Media player based on MPlayer and mplayer2
# sad: Search and replace | Space Age seD
# mysql: Open source relational database management system
# navi: Interactive cheatsheet tool for the command-line
# ncdu: NCurses Disk Usage
# neovim: Ambitious Vim-fork focused on extensibility and agility
# nethogs: Net top tool grouping bandwidth per process
# newman: Command-line collection runner for Postman
# num-utils: Programs for dealing with numbers from the command-line
# pdfgrep: Search PDFs for strings matching a regular expression
# pgcli: CLI for Postgres with auto-completion and syntax highlighting
# pipenv: Python dependency management tool
# pngcrush: Optimizer for PNG files
# pngpaste: Paste PNG into files
# pngquant: PNG image optimizing utility
# prettyping: Wrapper to colorize and simplify ping's output
# procs: Modern replacement for ps written by Rust
# proctools: OpenBSD and Darwin versions of pgrep, pkill, and pfind
# proselint: Linter for prose
# pspg: Unix pager optimized for psql
# pstree: Show ps output as a tree
# ranger: File browser
# rcm: RC file (dotfile) management
# redis: Persistent key-value database, with built-in net interface
# ripgrep-all: Wrapper around ripgrep that adds multiple rich file types
# rmlint: Extremely fast tool to remove dupes and other lint from your filesystem
# sbt: Build tool for Scala projects
# sd: Intuitive find & replace CLI
# shellcheck: Static analysis and lint tool, for (ba)sh scripts
# gocmdpev: Command-line GO Postgres query visualizer
# um: Command-line utility for creating and maintaining personal man pages
# criterion: [no description]
# socat: SOcket CAT: netcat on steroids
# speedtest-cli: Command-line interface for https://speedtest.net bandwidth tests
# subliminal: Library to search and download subtitles
# tag: Manipulate and query tags on macOS files
# task: Feature-rich console based todo list manager
# tealdeer: Very fast implementation of tldr in Rust
# telnet: User interface to the TELNET protocol
# terminal-notifier: Send macOS User Notifications from the command-line
# the_silver_searcher: Code-search similar to ack
# parity: Shell commands for environment parity for Heroku apps
# timewarrior: Command-line time tracking application
# tmux: Terminal multiplexer
# tokei: Program that allows you to count code, quickly
# tomcat: Implementation of Java Servlet and JavaServer Pages
# translate-shell: Command-line translator using Google Translate and more
# tree: Display directories as trees (with optional color/HTML output)
# unar: Command-line unarchiving tools supporting multiple formats
# universal-ctags: Maintained ctags implementation
# unused: Identify potentially unused code
# urlview: URL extractor/launcher
# vim: Vi 'workalike' with many additional features
# w-calc: Very capable calculator
# watch: Executes a program periodically, showing output fullscreen
# watchman: Watch files and take action when they change
# watson: Command-line tool to track (your) time
# wget: Internet file retriever
# wifi-password: Show the current WiFi network password
# wordnet: Lexical database for the English language
# xh: Friendly and fast tool for sending HTTP requests
# xmlstarlet: XML command-line utilities
# xplr: Hackable, minimal, fast TUI file explorer
# xsv: Fast CSV toolkit written in Rust
# yt-dlp: A youtube-dl fork with additional features and fixes
# zinit: Flexible and fast Zsh plugin manager
# zoxide: Shell extension to navigate your filesystem faster
# zsh: UNIX shell (command interpreter)

tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "thoughtbot/formulae"
tap "unused-code/formulae"
tap "goles/battery"

# brew
brew "ansiweather"
brew "aria2"
brew "ascii"
brew "asciinema"
brew "asdf"
brew "bandwhich"
brew "bash"
brew "bat-extras"
brew "bats-core"
brew "battery"
brew "bmon"
brew "bottom"
brew "briss"
brew "candle"
brew "choose-rust"
brew "chrome-cli"
brew "colordiff"
brew "criterion"
brew "csvkit"
brew "curl"
brew "detox"
brew "diffutils"
brew "docker"
brew "docker-completion"
brew "docker-compose"
brew "docker-machine"
brew "dog"
brew "dos2unix"
brew "dust"
brew "duti"
brew "elixir"
brew "emscripten"
brew "exa"
brew "exercism"
brew "exiftool"
brew "fd"
brew "gdrive"
brew "geckodriver"
brew "gh"
brew "git"
brew "git-extras"
brew "git-filter-repo"
brew "git-standup"
brew "gnu-sed"
brew "gnuplot"
brew "go"
brew "gocmdpev"
brew "gradle"
brew "graphviz"
brew "grep"
brew "grex"
brew "gtk"+3
brew "hexyl"
brew "highlight"
brew "httpie"
brew "httrack"
brew "hub"
brew "iftop"
brew "imagemagick"
brew "languagetool"
brew "less"
brew "lesspipe"
brew "libproxy"
brew "llvm"
brew "locateme"
brew "lsd"
brew "maven"
brew "mitmproxy"
brew "mono"
brew "moreutils"
brew "mpv", args: ["HEAD"]
brew "mysql"
brew "navi"
brew "ncdu"
brew "neovim", args: ["HEAD"]
brew "nethogs"
brew "newman"
brew "num-utils"
brew "parity"
brew "pdfgrep"
brew "pgcli"
brew "pipenv"
brew "pngcrush"
brew "pngpaste"
brew "pngquant"
brew "postgresql", restart_service: true
brew "prettyping"
brew "procs"
brew "proctools"
brew "proselint"
brew "pspg"
brew "pstree"
brew "ranger"
brew "rcm"
brew "redis", restart_service: true
brew "ripgrep-all"
brew "rmlint"
brew "sad"
brew "sbt"
brew "sd"
brew "shellcheck"
brew "socat"
brew "speedtest-cli"
brew "subliminal"
brew "tag"
brew "task"
brew "tealdeer"
brew "telnet"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "timewarrior"
brew "tmux", args: ["HEAD"]
brew "tokei"
brew "tomcat"
brew "translate-shell"
brew "tree"
brew "um"
brew "unar"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "unused"
brew "urlview"
brew "valgrind"
brew "vim"
brew "w-calc"
brew "watch"
brew "watchman"
brew "watson"
brew "wget"
brew "wifi-password"
brew "wordnet"
brew "xh"
brew "xmlstarlet"
brew "xplr"
brew "xsv"
brew "yt-dlp"
brew "zinit"
brew "zoxide"
brew "zsh"

# casks
cask "alacritty"
cask "alfred"
cask "alt-c"
cask "android-file-transfer"
cask "anki"
cask "appcleaner"
cask "brave-browser-beta"
cask "caffeine"
cask "calibre"
cask "chromedriver"
cask "cleanshot"
cask "coconutbattery"
cask "dash3"
cask "db-browser-for-sqlite"
cask "disk-drill"
cask "disk-inventory-x"
cask "docker"
cask "dotnet-sdk"
cask "dropbox"
cask "evernote"
cask "finicky"
cask "font-iosevka-nerd-font"
cask "gitify"
cask "google-chrome"
cask "gpg-suite"
cask "hammerspoon"
cask "karabiner-elements"
cask "keyboard-cleaner"
cask "keycastr"
cask "kindle"
cask "licecap"
cask "marked"
cask "ngrok"
cask "phantomjs"
cask "skitch"
cask "slate"
cask "suspicious-package"
cask "teamviewer"
cask "the-unarchiver"
cask "toggl-track"
cask "tor-browser"
cask "transmission"
cask "whatsapp"
cask "xee"
cask "xquartz"
cask "zoom"
