tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "choppsv1/term24"
tap "docmunch/pdftk"
tap "goles/battery"
tap "homebrew/boneyard"
tap "homebrew/bundle"
tap "homebrew/completions"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/fuse"
tap "homebrew/head-only"
tap "homebrew/services"
tap "homebrew/versions"
tap "mpv-player/mpv"
tap "neomutt/neomutt"
tap "neovim/neovim"
tap "phinze/cask"
tap "thoughtbot/formulae"
tap "tldr-pages/tldr"
tap "universal-ctags/universal-ctags"
tap "vince-bickers/fern"
cask "java"
cask "xquartz"
brew "ack"
brew "ansifilter"
brew "oniguruma"
brew "jq"
brew "ansiweather"
brew "aria2"
brew "docbook"
brew "asciidoc"
brew "atool"
brew "autoconf"
brew "automake"
brew "aws-shell"
brew "awscli"
brew "readline"
brew "bash"
brew "berkeley-db"
brew "binutils"
brew "bison"
brew "boost"
brew "openssl"
brew "python3"
brew "briss"
brew "burp"
brew "libpng"
brew "fontconfig"
brew "gettext"
brew "libffi"
brew "pcre"
brew "glib"
brew "pixman"
brew "cairo"
brew "catimg"
brew "cgdb"
brew "cheat"
brew "checkbashisms"
brew "chrome-cli"
brew "chromedriver"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "colordiff"
brew "colormake"
brew "coreutils"
brew "jpeg"
brew "libtiff"
brew "wxmac"
brew "erlang"
brew "couchdb"
brew "cscope"
brew "dbus"
brew "detox"
brew "diff-so-fancy"
brew "diffutils"
brew "perl"
brew "git"
brew "dockviz"
brew "docutils"
brew "duti"
brew "ecj"
brew "editorconfig"
brew "elixir"
brew "entr"
brew "exercism"
brew "exiftool"
brew "extract_url"
brew "fasd"
brew "feh"
brew "ffind"
brew "lame"
brew "x264"
brew "xvid"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "ffms2"
brew "gmp"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "fftw"
brew "figlet"
brew "findutils"
brew "flake8"
brew "fortune"
brew "fribidi"
brew "fzf"
brew "gawk"
brew "gdb"
brew "gdrive"
brew "geckodriver"
brew "geoip"
brew "imagemagick"
brew "gifify"
brew "gifsicle"
brew "git-extras"
brew "git-secrets"
brew "git-standup"
brew "gnu-sed"
brew "libunistring"
brew "nettle"
brew "gnutls"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "gnupg"
brew "lua"
brew "gnuplot"
brew "go"
brew "pkg-config"
brew "gobject-introspection"
brew "googler"
brew "gperftools"
brew "gradle"
brew "graphicsmagick"
brew "graphviz"
brew "hadolint"
brew "harfbuzz"
brew "heroku"
brew "highlight"
brew "hilite"
brew "htop-osx"
brew "httpdiff"
brew "httpflow"
brew "httpie"
brew "hub"
brew "iftop"
brew "imgur-screenshot"
brew "ipcalc"
brew "iproute2mac"
brew "irssi"
brew "jemalloc"
brew "jid"
brew "languagetool"
brew "lastpass-cli", args: ["with-pinentry"]
brew "ledger"
brew "leiningen"
brew "leptonica"
brew "libass"
brew "libcaca"
brew "libnet"
brew "libnids"
brew "libpcap"
brew "libsass"
brew "libyaml"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "libzip"
brew "little-cms2"
brew "lnav"
brew "loc"
brew "locateme"
brew "lzo"
brew "macvim"
brew "media-info"
brew "mitmproxy"
brew "mobile-shell", args: ["HEAD"]
brew "mongodb"
brew "mono"
brew "most"
brew "mozjpeg"
brew "mpg123"
brew "mpv", args: ["with-bundle"]
brew "mps-youtube"
brew "msgpack"
brew "mtr"
brew "multitail"
brew "tesseract"
brew "vapoursynth"
brew "mvtools"
brew "mycli"
brew "mysql"
brew "ncdu"
brew "ncftp"
brew "ncurses"
brew "netcat"
brew "nethogs"
brew "newsbeuter"
brew "nload"
brew "nmap"
brew "node"
brew "openvpn"
brew "oysttyer"
brew "packer"
brew "pandoc"
brew "parallel"
brew "poppler"
brew "pdfgrep"
brew "postgresql", restart_service: true
brew "pgcli"
brew "pgformatter"
brew "phantomjs"
brew "pngcrush"
brew "proselint"
brew "unixodbc"
brew "psqlodbc"
brew "pstree"
brew "pup"
brew "qt"
brew "qt@5.5"
brew "ranger"
brew "ruby-build"
brew "rbenv"
brew "rbenv-ctags"
brew "reattach-to-user-namespace"
brew "recode"
brew "redis", restart_service: true
brew "remind"
brew "resty"
brew "rig"
brew "ripgrep"
brew "rmlint"
brew "rsync"
brew "rtv"
brew "ruby-install"
brew "rust"
brew "shellcheck"
brew "slugify"
brew "slurm"
brew "socat"
brew "source-highlight"
brew "spark"
brew "speedtest_cli"
brew "spoof-mac"
brew "subliminal"
brew "task"
brew "taskd"
brew "tasksh"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tidy-html5"
brew "tig"
brew "timewarrior"
brew "tldr"
brew "tmux"
brew "toilet"
brew "tokyo-cabinet"
brew "tor"
brew "tpp"
brew "translate-shell"
brew "trash"
brew "tree"
brew "typespeed"
brew "unar"
brew "unibilium"
brew "unoconv", args: ["HEAD"]
brew "urlview"
brew "utf8proc"
brew "vagrant-completion"
brew "valgrind"
brew "vim"
brew "vit"
brew "w3m"
brew "watch"
brew "watchman"
brew "weechat", args: ["with-aspell", "with-lua", "with-perl", "with-python"]
brew "wget"
brew "wifi-password"
brew "wireshark", args: ["with-qt"]
brew "wrk-trello"
brew "xmlstarlet"
brew "yarn"
brew "you-get"
brew "z"
brew "zsh"
brew "zsh-navigation-tools"
brew "goles/battery/battery"
brew "neomutt/neomutt/neomutt"
brew "neovim/neovim/neovim", args: ["HEAD"]
brew "thoughtbot/formulae/parity"
brew "thoughtbot/formulae/rcm"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "acorn"
cask "alfred"
cask "alternote"
cask "android-file-transfer"
cask "anki"
cask "appcleaner"
cask "arq"
cask "atom"
cask "bartender"
cask "betterzipql"
cask "boostnote"
cask "burp-suite"
cask "calibre"
cask "caprine"
cask "charles"
cask "chrome-devtools"
cask "cloak"
cask "cloudup"
cask "cool-retro-term"
cask "disk-inventory-x"
cask "docker"
cask "drop-to-gif"
cask "dropbox"
cask "fantastical"
cask "firefoxdeveloperedition"
cask "flash-player"
cask "font-inconsolata"
cask "font-inconsolata-g-for-powerline"
cask "ginbox"
cask "github-desktop"
cask "google-chrome-beta"
cask "google-chrome-canary"
cask "google-play-music-desktop-player"
cask "haskell-platform"
cask "httpscoop"
cask "insomniax"
cask "iterm2-beta"
cask "karabiner"
cask "keyboard-cleaner"
cask "lepton"
cask "licecap"
cask "macdropany"
cask "madruby"
cask "marked"
cask "mattr-slate"
cask "ngrok"
cask "nvalt"
cask "omnifocus"
cask "openemu-experimental"
cask "osxfuse"
cask "postico"
cask "postman"
cask "private-internet-access"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklook-pat"
cask "quicklookase"
cask "screenflick"
cask "screenflow"
cask "screenhero"
cask "seil"
cask "shiori"
cask "shortcat"
cask "sketch"
cask "skitch"
cask "skype"
cask "slack"
cask "sqlitebrowser"
cask "suspicious-package"
cask "taskwarrior-pomodoro"
cask "totalspaces"
cask "tunnelblick"
cask "vagrant"
cask "vagrant-manager"
cask "vienna"
cask "vlc"
cask "webpquicklook"
cask "whatsapp"
cask "wifi-explorer"
cask "wireshark-chmodbpf"
cask "yakyak"
cask "ynab"
cask "yujitach-menumeters"
